---
kind: method
id: M:Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetFilteredSolutionsPartsTypeCounts
source: html/edb993fe-0e9a-1283-b89d-f04d2c69a403.htm
---
# Autodesk.Revit.UI.Events.FabricationPartBrowserChangedEventArgs.GetFilteredSolutionsPartsTypeCounts Method

Returns the active fabrication part type usage count in fitlered routing solutions.

## Syntax (C#)
```csharp
public IDictionary<ElementId, int> GetFilteredSolutionsPartsTypeCounts()
```